
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 7 to change, 9 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.redis-v6.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login.css&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]
  * azurerm_storage_blob.b2c_policy_images[&#34;favicon.ico&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa-cy-GB.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "02858a7a9dce8287c022c8105d454bcb" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-cy-GB.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "admin-mfa-cy-GB.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-cy-GB.html" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "bf2dc6b9b46c837bd0c8202f4748c359" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "admin-mfa-en.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-en.html" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["login-cy-GB.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "25c77ef53f53487335f5c6fd83b7ead3" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login-cy-GB.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login-cy-GB.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login-cy-GB.html" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["login-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "020c03d70ebc17857f29604b4475315c" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login-en.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login-en.html" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["login.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "d4d843b100d349324a4f74ccbcf6a9fd" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw-cy-GB.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "037e82da354ab3c41c3904389b5a9eb8" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-cy-GB.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw-cy-GB.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-cy-GB.html" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "b0baf830dae5a2b8bac0256116c6a180" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw-en.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "9899ebed5ba758d116e34ac561e34e1a" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["favicon.ico"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ content_md5            = "dec306ee07463221fae2299afea1694a" -> "a90776c99cc9bf3d9dbe593284d6bbf6" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "favicon.ico"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                     = "CaTH-Group"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2025-05-21T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2025-05-20T09:49:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.redis-v6.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg/providers/Microsoft.Cache/redis/pip-v6-stg"
        name                               = "pip-v6-stg"
        tags                               = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 200
          ~ maxmemory_delta                         = 125 -> 200
          ~ maxmemory_reserved                      = 125 -> 200
            # (14 unchanged attributes hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                               = "pipsssastg"
        tags                               = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 7 to change, 9 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":225,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->